In [2]:
import pandas as pd
df=pd.read_csv("1745501008647-data_cleaning_sample.csv");

In [3]:
df

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [5]:
df.sort_values("Age")

      Name   Age         City Gender              Email   Join Date
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [6]:
df.sort_values(["Age","Email"])

      Name   Age         City Gender              Email   Join Date
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [16]:
df2=df.sort_values(["Age","Email"],ascending=False)

In [19]:
df2.reset_index(drop=True,inplace=True)

In [20]:
df2

      Name   Age         City Gender              Email   Join Date
0      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
1      NaN  28.0        Delhi      F     eve@domain.com         NaN
2    Alice  25.0     New York      F  alice@example.com  01-05-2021
3    Alice  25.0     New York      F  alice@example.com  01-05-2021
4    Alice  25.0     New York      F  alice@example.com  01-05-2021
5    David  22.0       Mumbai      M  david@example.com  12-11-2019
6  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
7  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [21]:
df2.sort_index()

      Name   Age         City Gender              Email   Join Date
0      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
1      NaN  28.0        Delhi      F     eve@domain.com         NaN
2    Alice  25.0     New York      F  alice@example.com  01-05-2021
3    Alice  25.0     New York      F  alice@example.com  01-05-2021
4    Alice  25.0     New York      F  alice@example.com  01-05-2021
5    David  22.0       Mumbai      M  david@example.com  12-11-2019
6  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
7  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [25]:
df2["rank"]=df2["Age"].rank(method="dense")

In [26]:
df2

      Name   Age         City Gender              Email   Join Date  rank
0      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020   4.0
1      NaN  28.0        Delhi      F     eve@domain.com         NaN   3.0
2    Alice  25.0     New York      F  alice@example.com  01-05-2021   2.0
3    Alice  25.0     New York      F  alice@example.com  01-05-2021   2.0
4    Alice  25.0     New York      F  alice@example.com  01-05-2021   2.0
5    David  22.0       Mumbai      M  david@example.com  12-11-2019   1.0
6  Charlie   NaN        Delhi      M    charlie@example  20-07-2021   NaN
7  Charlie   NaN        Delhi      M    charlie@example  20-07-2021   NaN
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021   NaN

In [24]:
df2

      Name   Age         City Gender              Email   Join Date  rank
0      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020   6.0
1      NaN  28.0        Delhi      F     eve@domain.com         NaN   5.0
2    Alice  25.0     New York      F  alice@example.com  01-05-2021   3.0
3    Alice  25.0     New York      F  alice@example.com  01-05-2021   3.0
4    Alice  25.0     New York      F  alice@example.com  01-05-2021   3.0
5    David  22.0       Mumbai      M  david@example.com  12-11-2019   1.0
6  Charlie   NaN        Delhi      M    charlie@example  20-07-2021   NaN
7  Charlie   NaN        Delhi      M    charlie@example  20-07-2021   NaN
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021   NaN

In [30]:
df2.rename(columns={"Name":"First Name"})

  First Name   Age         City Gender              Email   Join Date  rank
0        Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020   4.0
1        NaN  28.0        Delhi      F     eve@domain.com         NaN   3.0
2      Alice  25.0     New York      F  alice@example.com  01-05-2021   2.0
3      Alice  25.0     New York      F  alice@example.com  01-05-2021   2.0
4      Alice  25.0     New York      F  alice@example.com  01-05-2021   2.0
5      David  22.0       Mumbai      M  david@example.com  12-11-2019   1.0
6    Charlie   NaN        Delhi      M    charlie@example  20-07-2021   NaN
7    Charlie   NaN        Delhi      M    charlie@example  20-07-2021   NaN
8    Charlie   NaN        Delhi      M    charlie@example  20-07-2021   NaN

In [35]:
df2

      Name   Age         City Gender              Email   Join Date  rank
0      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020   4.0
1      NaN  28.0        Delhi      F     eve@domain.com         NaN   3.0
2    Alice  25.0     New York      F  alice@example.com  01-05-2021   2.0
3    Alice  25.0     New York      F  alice@example.com  01-05-2021   2.0
4    Alice  25.0     New York      F  alice@example.com  01-05-2021   2.0
5    David  22.0       Mumbai      M  david@example.com  12-11-2019   1.0
6  Charlie   NaN        Delhi      M    charlie@example  20-07-2021   NaN
7  Charlie   NaN        Delhi      M    charlie@example  20-07-2021   NaN
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021   NaN

In [55]:
df2.columns = ["Name", "Age", "City","Gender","Email","Join Date","Rank"]

In [37]:
df2.rename(index={0:"row1",1:"row2"})

         Name   Age         City Gender              Email   Join Date  rank
row1      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020   4.0
row2      NaN  28.0        Delhi      F     eve@domain.com         NaN   3.0
2       Alice  25.0     New York      F  alice@example.com  01-05-2021   2.0
3       Alice  25.0     New York      F  alice@example.com  01-05-2021   2.0
4       Alice  25.0     New York      F  alice@example.com  01-05-2021   2.0
5       David  22.0       Mumbai      M  david@example.com  12-11-2019   1.0
6     Charlie   NaN        Delhi      M    charlie@example  20-07-2021   NaN
7     Charlie   NaN        Delhi      M    charlie@example  20-07-2021   NaN
8     Charlie   NaN        Delhi      M    charlie@example  20-07-2021   NaN

In [41]:
df2=df2[[	"rank"	,"Age",	"City",	"Gender",	"Email"	,"Join Date",	"Name"]] # Reorder as desired

In [56]:
df2

   Name  Age         City Gender              Email   Join Date     Rank
0  30.0  4.0  Los Angeles      M    bob@example.com  15-06-2020      Bob
1  28.0  3.0        Delhi      F     eve@domain.com         NaN      NaN
2  25.0  2.0     New York      F  alice@example.com  01-05-2021    Alice
3  25.0  2.0     New York      F  alice@example.com  01-05-2021    Alice
4  25.0  2.0     New York      F  alice@example.com  01-05-2021    Alice
5  22.0  1.0       Mumbai      M  david@example.com  12-11-2019    David
6   NaN  NaN        Delhi      M    charlie@example  20-07-2021  Charlie
7   NaN  NaN        Delhi      M    charlie@example  20-07-2021  Charlie
8   NaN  NaN        Delhi      M    charlie@example  20-07-2021  Charlie

In [47]:
cols=["Age"]+[col for col in df2.columns if col!="Age"]
df2=df2[cols]

In [48]:
df2

    Age  rank         City Gender              Email   Join Date     Name
0  30.0   4.0  Los Angeles      M    bob@example.com  15-06-2020      Bob
1  28.0   3.0        Delhi      F     eve@domain.com         NaN      NaN
2  25.0   2.0     New York      F  alice@example.com  01-05-2021    Alice
3  25.0   2.0     New York      F  alice@example.com  01-05-2021    Alice
4  25.0   2.0     New York      F  alice@example.com  01-05-2021    Alice
5  22.0   1.0       Mumbai      M  david@example.com  12-11-2019    David
6   NaN   NaN        Delhi      M    charlie@example  20-07-2021  Charlie
7   NaN   NaN        Delhi      M    charlie@example  20-07-2021  Charlie
8   NaN   NaN        Delhi      M    charlie@example  20-07-2021  Charlie